Revit 2027 API
CableTray.IsValidRungSpace Method
 Identifies if the input rung space is valid.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidRungSpace(
	double rungSpace
)
Public Function IsValidRungSpace (
	rungSpace As Double
) As Boolean
public:
bool IsValidRungSpace(
	double rungSpace
)
member IsValidRungSpace :
        rungSpace : float -> bool
Parameters
rungSpace Double
 The rung space to check.
Return Value
Boolean
 True if the value is acceptable, false otherwise.
Remarks
 rung space should be at least equal to or larger than rang width which is 1 inch.
See Also
Reference
CableTray Class
Autodesk.Revit.DB.Electrical Namespace